<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Route Prefix
    |
    | 路由前缀
    |--------------------------------------------------------------------------
    */
    'route_prefix'     => 'env-editor',

    /*
    |--------------------------------------------------------------------------
    | Route Middleware
    |
    | 路由中间件
    |--------------------------------------------------------------------------
    | Here you can append your middleware
    | If you don`t want verify password, you can delete `env.auth` anyhow
    |
    | 这边可以定义你自己的中间件，当然也可以把 `env.auth` 删除
    */
    'route_middleware' => ['env.auth'],

    /*
    |--------------------------------------------------------------------------
    | env path
    |
    | env 的路径
    |--------------------------------------------------------------------------
    */
    'env_path'         => base_path('.env'),

    /*
    |--------------------------------------------------------------------------
    | Simple Authentication Setting
    |
    | 简单的认证设置
    |--------------------------------------------------------------------------
    | Here you can set your user and password to avoid others changing your configuration
    |
    | 这边可以设置用户和密码来避免他人更改你的配置
    */
    'auth_user'        => '',
    'auth_password'    => ''
];